MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX795F512H.atdf
      <value-group caption="USB PLL Input Divider bits" name="DEVCFG2__UPLLIDIV">
         <value caption="1x Divider" name="DIV_1" value="0x0" />
         <value caption="2x Divider" name="DIV_2" value="0x1" />
         <value caption="3x Divider" name="DIV_3" value="0x2" />
         <value caption="4x Divider" name="DIV_4" value="0x3" />
         <value caption="5x Divider" name="DIV_5" value="0x4" />
         <value caption="6x Divider" name="DIV_6" value="0x5" />
         <value caption="10x Divider" name="DIV_10" value="0x6" />
         <value caption="12x Divider" name="DIV_12" value="0x7" />
      </value-group>
      <value-group caption="USB PLL Enable bit" name="DEVCFG2__UPLLEN">
         <value caption="Enable USB PLL" name="ON" value="0x0" />
         <value caption="Disable and bypass USB PLL" name="OFF" value="0x1" />
      </value-group>
      <value-group caption="Default PLL Output Divisor bits" name="DEVCFG2__FPLLODIV">
         <value caption="PLL Divide by 1" name="DIV_1" value="0x0" />
         <value caption="PLL Divide by 2" name="DIV_2" value="0x1" />
         <value caption="PLL Divide by 4" name="DIV_4" value="0x2" />
         <value caption="PLL Divide by 8" name="DIV_8" value="0x3" />
         <value caption="PLL Divide by 16" name="DIV_16" value="0x4" />
         <value caption="PLL Divide by 32" name="DIV_32" value="0x5" />
         <value caption="PLL Divide by 64" name="DIV_64" value="0x6" />
         <value caption="PLL Divide by 256" name="DIV_256" value="0x7" />
      </value-group>
      <value-group caption="Oscillator Selection bits" name="DEVCFG1__FNOSC">
         <value caption="Fast RC Oscillator (FRC)" name="FRC" value="0x0" />
         <value caption="Fast RC Oscillator with divide-by-N with PLL module (FRCDIV+PLL)" name="FRCPLL" value="0x1" />
         <value caption="Primary Osc (XT,HS,EC)" name="PRI" value="0x2" />
         <value caption="Primary Osc w/PLL (XT+,HS+,EC+PLL)" name="PRIPLL" value="0x3" />
         <value caption="Low Power Secondary Osc (SOSC)" name="SOSC" value="0x4" />
         <value caption="Low Power RC Osc (LPRC)" name="LPRC" value="0x5" />
         <value caption="Fast RC Osc w/Div-by-16 (FRC/16)" name="FRCDIV16" value="0x6" />
         <value caption="Fast RC Osc w/Div-by-N (FRCDIV)" name="FRCDIV" value="0x7" />
      </value-group>
      <value-group caption="Secondary Oscillator Enable bit" name="DEVCFG1__FSOSCEN">
         <value caption="Disabled" name="OFF" value="0x0" />
         <value caption="Enabled" name="ON" value="0x1" />
      </value-group>
      <value-group caption="Internal External Switchover bit" name="DEVCFG1__IESO">
         <value caption="Internal External Switchover mode is disabled (Two-Speed Start-up is disabled)" name="OFF" value="0x0" />
         <value caption="Internal External Switchover mode is enabled (Two-Speed Start-up is enabled)" name="ON" value="0x1" />
      </value-group>
      <value-group caption="Primary Oscillator Configuration bits" name="DEVCFG1__POSCMOD">
         <value caption="External clock mode" name="EC" value="0x0" />
         <value caption="XT osc mode" name="XT" value="0x1" />
         <value caption="HS osc mode" name="HS" value="0x2" />
         <value caption="Primary osc disabled" name="OFF" value="0x3" />
      </value-group>
      <value-group caption="CLKO Enable Configuration bit" name="DEVCFG1__OSCIOFNC">
         <value caption="CLKO output is disabled" name="OFF" value="0x1" />
         <value caption="CLKO output signal is active on the OSCO pin" name="ON" value="0x0" />
      </value-group>
      <value-group caption="Peripheral Bus Clock Divisor Default Value bits" name="DEVCFG1__FPBDIV">
         <value caption="Pb_Clk is Sys_Clk/1" name="DIV_1" value="0x0" />
         <value caption="Pb_Clk is Sys_Clk/2" name="DIV_2" value="0x1" />
         <value caption="Pb_Clk is Sys_Clk/4" name="DIV_4" value="0x2" />
         <value caption="Pb_Clk is Sys_Clk/8" name="DIV_8" value="0x3" />
      </value-group>
      <value-group caption="Clock Switching and Monitor Selection Configuration bits" name="DEVCFG1__FCKSM">
         <value caption="Clock Switch Enable, FSCM Enabled" name="CSECME" value="0x0" />
         <value caption="Clock Switch Enable, FSCM Disabled" name="CSECMD" value="0x1" />
         <value caption="Clock Switch Disable, FSCM Disabled" name="CSDCMD" value="0x3" />
      </value-group>
      <value-group caption="Watchdog Timer Postscale Select bits" name="DEVCFG1__WDTPS">
         <value caption="1:1" name="PS1" value="0x0" />
         <value caption="1:2" name="PS2" value="0x1" />
         <value caption="1:4" name="PS4" value="0x2" />
         <value caption="1:8" name="PS8" value="0x3" />
         <value caption="1:16" name="PS16" value="0x4" />
         <value caption="1:32" name="PS32" value="0x5" />
         <value caption="1:64" name="PS64" value="0x6" />
         <value caption="1:128" name="PS128" value="0x7" />
         <value caption="1:256" name="PS256" value="0x8" />
         <value caption="1:512" name="PS512" value="0x9" />
         <value caption="1:1024" name="PS1024" value="0xa" />
         <value caption="1:2048" name="PS2048" value="0xb" />
         <value caption="1:4096" name="PS4096" value="0xc" />
         <value caption="1:8192" name="PS8192" value="0xd" />
         <value caption="1:16384" name="PS16384" value="0xe" />
         <value caption="1:32768" name="PS32768" value="0xf" />
         <value caption="1:65536" name="PS65536" value="0x10" />
         <value caption="1:131072" name="PS131072" value="0x11" />
         <value caption="1:262144" name="PS262144" value="0x12" />
         <value caption="1:524288" name="PS524288" value="0x13" />
         <value caption="1:1048576" name="PS1048576" value="0x14" />
      </value-group>
      <value-group caption="Watchdog Timer Enable bit" name="DEVCFG1__FWDTEN">
         <value caption="WDT Disabled (SWDTEN Bit Controls)" name="OFF" value="0x0" />
         <value caption="WDT Enabled" name="ON" value="0x1" />
      </value-group>
      <value-group caption="Background Debugger Enable bits (forced to 11 if code-protect is enabled)" name="DEVCFG0__DEBUG">
         <value caption="Debugger is enabled" name="ON" value="0x2" />
         <value caption="Debugger is disabled" name="OFF" value="0x3" />
      </value-group>
