MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX795F512H.atdf
      <value-group caption="Extended Identifier Enable bits" name="C2RXF1__EXID">
         <value caption="Match only messages with extended identifier addresses" name="" value="0x1" />
         <value caption="Match only messages with standard identifier addresses" name="" value="0x0" />
      </value-group>
      <value-group caption="Standard Identifier bits" name="C2RXF1__SID">
         <value caption="Message address bit SIDx must be 1 to match filter" name="" value="0x1" />
         <value caption="Message address bit SIDx must be 0 to match filter" name="" value="0x0" />
      </value-group>
      <value-group caption="Extended Identifier bits" name="C1RXF2__EID">
         <value caption="Message address bit EIDx must be 1 to match filter" name="" value="0x1" />
         <value caption="Message address bit EIDx must be 0 to match filter" name="" value="0x0" />
      </value-group>
      <value-group caption="Extended Identifier Enable bits" name="C1RXF2__EXID">
         <value caption="Match only messages with extended identifier addresses" name="" value="0x1" />
         <value caption="Match only messages with standard identifier addresses" name="" value="0x0" />
      </value-group>
      <value-group caption="Standard Identifier bits" name="C1RXF2__SID">
         <value caption="Message address bit SIDx must be 1 to match filter" name="" value="0x1" />
         <value caption="Message address bit SIDx must be 0 to match filter" name="" value="0x0" />
      </value-group>
      <value-group caption="Extended Identifier bits" name="C2RXF2__EID">
         <value caption="Message address bit EIDx must be 1 to match filter" name="" value="0x1" />
         <value caption="Message address bit EIDx must be 0 to match filter" name="" value="0x0" />
      </value-group>
      <value-group caption="Extended Identifier Enable bits" name="C2RXF2__EXID">
         <value caption="Match only messages with extended identifier addresses" name="" value="0x1" />
         <value caption="Match only messages with standard identifier addresses" name="" value="0x0" />
      </value-group>
      <value-group caption="Standard Identifier bits" name="C2RXF2__SID">
         <value caption="Message address bit SIDx must be 1 to match filter" name="" value="0x1" />
         <value caption="Message address bit SIDx must be 0 to match filter" name="" value="0x0" />
      </value-group>
      <value-group caption="Extended Identifier bits" name="C1RXF3__EID">
         <value caption="Message address bit EIDx must be 1 to match filter" name="" value="0x1" />
         <value caption="Message address bit EIDx must be 0 to match filter" name="" value="0x0" />
      </value-group>
      <value-group caption="Extended Identifier Enable bits" name="C1RXF3__EXID">
         <value caption="Match only messages with extended identifier addresses" name="" value="0x1" />
         <value caption="Match only messages with standard identifier addresses" name="" value="0x0" />
      </value-group>
      <value-group caption="Standard Identifier bits" name="C1RXF3__SID">
         <value caption="Message address bit SIDx must be 1 to match filter" name="" value="0x1" />
         <value caption="Message address bit SIDx must be 0 to match filter" name="" value="0x0" />
      </value-group>
      <value-group caption="Extended Identifier bits" name="C2RXF3__EID">
         <value caption="Message address bit EIDx must be 1 to match filter" name="" value="0x1" />
         <value caption="Message address bit EIDx must be 0 to match filter" name="" value="0x0" />
      </value-group>
      <value-group caption="Extended Identifier Enable bits" name="C2RXF3__EXID">
         <value caption="Match only messages with extended identifier addresses" name="" value="0x1" />
         <value caption="Match only messages with standard identifier addresses" name="" value="0x0" />
      </value-group>
      <value-group caption="Standard Identifier bits" name="C2RXF3__SID">
         <value caption="Message address bit SIDx must be 1 to match filter" name="" value="0x1" />
         <value caption="Message address bit SIDx must be 0 to match filter" name="" value="0x0" />
      </value-group>
      <value-group caption="Extended Identifier bits" name="C1RXF4__EID">
         <value caption="Message address bit EIDx must be 1 to match filter" name="" value="0x1" />
         <value caption="Message address bit EIDx must be 0 to match filter" name="" value="0x0" />
      </value-group>
      <value-group caption="Extended Identifier Enable bits" name="C1RXF4__EXID">
         <value caption="Match only messages with extended identifier addresses" name="" value="0x1" />
         <value caption="Match only messages with standard identifier addresses" name="" value="0x0" />
      </value-group>
      <value-group caption="Standard Identifier bits" name="C1RXF4__SID">
         <value caption="Message address bit SIDx must be 1 to match filter" name="" value="0x1" />
         <value caption="Message address bit SIDx must be 0 to match filter" name="" value="0x0" />
      </value-group>
      <value-group caption="Extended Identifier bits" name="C2RXF4__EID">
         <value caption="Message address bit EIDx must be 1 to match filter" name="" value="0x1" />
         <value caption="Message address bit EIDx must be 0 to match filter" name="" value="0x0" />
      </value-group>
      <value-group caption="Extended Identifier Enable bits" name="C2RXF4__EXID">
         <value caption="Match only messages with extended identifier addresses" name="" value="0x1" />
         <value caption="Match only messages with standard identifier addresses" name="" value="0x0" />
      </value-group>
      <value-group caption="Standard Identifier bits" name="C2RXF4__SID">
         <value caption="Message address bit SIDx must be 1 to match filter" name="" value="0x1" />
         <value caption="Message address bit SIDx must be 0 to match filter" name="" value="0x0" />
      </value-group>
      <value-group caption="Extended Identifier bits" name="C1RXF5__EID">
         <value caption="Message address bit EIDx must be 1 to match filter" name="" value="0x1" />
         <value caption="Message address bit EIDx must be 0 to match filter" name="" value="0x0" />
      </value-group>
      <value-group caption="Extended Identifier Enable bits" name="C1RXF5__EXID">
         <value caption="Match only messages with extended identifier addresses" name="" value="0x1" />
         <value caption="Match only messages with standard identifier addresses" name="" value="0x0" />
      </value-group>
      <value-group caption="Standard Identifier bits" name="C1RXF5__SID">
         <value caption="Message address bit SIDx must be 1 to match filter" name="" value="0x1" />
         <value caption="Message address bit SIDx must be 0 to match filter" name="" value="0x0" />
      </value-group>
      <value-group caption="Extended Identifier bits" name="C2RXF5__EID">
         <value caption="Message address bit EIDx must be 1 to match filter" name="" value="0x1" />
         <value caption="Message address bit EIDx must be 0 to match filter" name="" value="0x0" />
      </value-group>
