MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX795F512H.atdf
      <value-group caption="Full Interrupt Enable bit" name="C1FIFOINT9__RXFULLIE">
         <value caption="Interrupt enabled for FIFO full" name="" value="0x1" />
         <value caption="Interrupt disabled for FIFO full" name="" value="0x0" />
      </value-group>
      <value-group caption="Overflow Interrupt Enable bit" name="C1FIFOINT9__RXOVFLIE">
         <value caption="Interrupt enabled for overflow event" name="" value="0x1" />
         <value caption="Interrupt disabled for overflow event" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit FIFO Empty Interrupt Enable bit" name="C1FIFOINT9__TXEMPTYIE">
         <value caption="Interrupt enabled for FIFO empty" name="" value="0x1" />
         <value caption="Interrupt disabled for FIFO empty" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit FIFO Half Full Interrupt Enable bit" name="C1FIFOINT9__TXHALFIE">
         <value caption="Interrupt enabled for FIFO half full" name="" value="0x1" />
         <value caption="Interrupt disabled for FIFO half full" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit FIFO Not Full Interrupt Enable bit" name="C1FIFOINT9__TXNFULLIE">
         <value caption="Interrupt enabled for FIFO not full" name="" value="0x1" />
         <value caption="Interrupt disabled for FIFO not full" name="" value="0x0" />
      </value-group>
      <value-group caption="Receive Buffer Not Empty Interrupt Flag bit" name="C2FIFOINT9__RXNEMPTYIF">
         <value caption="(TXEN is 1) Unused, reads 0 / (TXEN is 0) FIFO is at least half full" name="" value="0x1" />
         <value caption="(TXEN is 1) Unused, reads 0 / (TXEN is 0) FIFO is less than half full" name="" value="0x0" />
      </value-group>
      <value-group caption="Receive FIFO Half Full Interrupt Flag bit" name="C2FIFOINT9__RXHALFIF">
         <value caption="(TXEN is 1) Unused, reads 0 / (TXEN is 0) FIFO is not empty, has at least 1 message" name="" value="0x1" />
         <value caption="(TXEN is 1) Unused, reads 0 / (TXEN is 0) FIFO is empty" name="" value="0x0" />
      </value-group>
      <value-group caption="Receive FIFO Full Interrupt Flag bit" name="C2FIFOINT9__RXFULLIF">
         <value caption="(TXEN is 1) Unused, reads 0 / (TXEN is 0) FIFO is full" name="" value="0x1" />
         <value caption="(TXEN is 1) Unused, reads 0 / (TXEN is 0) FIFO is not full" name="" value="0x0" />
      </value-group>
      <value-group caption="Receive FIFO Overflow Interrupt Flag bit" name="C2FIFOINT9__RXOVFLIF">
         <value caption="(TXEN is 1) Unused, reads 0 / (TXEN is 0) Overflow event has occurred" name="" value="0x1" />
         <value caption="(TXEN is 1) Unused, reads 0 / (TXEN is 0) Overflow event has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit FIFO Empty Interrupt Flag bit" name="C2FIFOINT9__TXEMPTYIF">
         <value caption="(TXEN is 1) FIFO is empty / (TXEN is 0) Unused, reads 0" name="" value="0x1" />
         <value caption="(TXEN is 1) FIFO is not empty / (TXEN is 0) Unused, reads 0" name="" value="0x0" />
      </value-group>
      <value-group caption="FIFO Transmit FIFO Half Empty Interrupt Flag bit" name="C2FIFOINT9__TXHALFIF">
         <value caption="(TXEN is 1) FIFO is at most half full / (TXEN is 0) Unused, reads 0" name="" value="0x1" />
         <value caption="(TXEN is 1) FIFO is more than half full / (TXEN is 0) Unused, reads 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit FIFO Not Full Interrupt Flag bit" name="C2FIFOINT9__TXNFULLIF">
         <value caption="(TXEN is 1) FIFO is not full / (TXEN is 0) Unused, reads 0" name="" value="0x1" />
         <value caption="(TXEN is 1) FIFO is full / (TXEN is 0) Unused, reads 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Empty Interrupt Enable bit" name="C2FIFOINT9__RXNEMPTYIE">
         <value caption="Interrupt enabled for FIFO not empty" name="" value="0x1" />
         <value caption="Interrupt disabled for FIFO not empty" name="" value="0x0" />
      </value-group>
      <value-group caption="FIFO Half Full Interrupt Enable bit" name="C2FIFOINT9__RXHALFIE">
         <value caption="Interrupt enabled for FIFO half full" name="" value="0x1" />
         <value caption="Interrupt disabled for FIFO half full" name="" value="0x0" />
      </value-group>
      <value-group caption="Full Interrupt Enable bit" name="C2FIFOINT9__RXFULLIE">
         <value caption="Interrupt enabled for FIFO full" name="" value="0x1" />
         <value caption="Interrupt disabled for FIFO full" name="" value="0x0" />
      </value-group>
      <value-group caption="Overflow Interrupt Enable bit" name="C2FIFOINT9__RXOVFLIE">
         <value caption="Interrupt enabled for overflow event" name="" value="0x1" />
         <value caption="Interrupt disabled for overflow event" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit FIFO Empty Interrupt Enable bit" name="C2FIFOINT9__TXEMPTYIE">
         <value caption="Interrupt enabled for FIFO empty" name="" value="0x1" />
         <value caption="Interrupt disabled for FIFO empty" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit FIFO Half Full Interrupt Enable bit" name="C2FIFOINT9__TXHALFIE">
         <value caption="Interrupt enabled for FIFO half full" name="" value="0x1" />
         <value caption="Interrupt disabled for FIFO half full" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit FIFO Not Full Interrupt Enable bit" name="C2FIFOINT9__TXNFULLIE">
         <value caption="Interrupt enabled for FIFO not full" name="" value="0x1" />
         <value caption="Interrupt disabled for FIFO not full" name="" value="0x0" />
      </value-group>
      <value-group caption="Message Transmit Priority bits" name="C1FIFOCON10__TXPRI">
         <value caption="Highest Message Priority" name="" value="0x3" />
         <value caption="High Intermediate Message Priority" name="" value="0x2" />
         <value caption="Low Intermediate Message Priority" name="" value="0x1" />
         <value caption="Lowest Message Priority" name="" value="0x0" />
      </value-group>
      <value-group caption="Auto RTR Enable bit" name="C1FIFOCON10__RTREN">
         <value caption="When a remote transmit is received, TXREQ will be set" name="" value="0x1" />
         <value caption="When a remote transmit is received, TXREQ will be unaffected" name="" value="0x0" />
      </value-group>
