MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX795F512H.atdf
      <value-group caption="Power-on Reset Flag bit" name="RCON__POR">
         <value caption="Power-on Reset has occurred" name="" value="0x1" />
         <value caption="Power-on Reset has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Brown-out Reset Flag bit" name="RCON__BOR">
         <value caption="Brown-out Reset has occurred" name="" value="0x1" />
         <value caption="Brown-out Reset has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Wake From Idle Flag bit" name="RCON__IDLE">
         <value caption="Device was in Idle mode" name="" value="0x1" />
         <value caption="Device was not in Idle mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Wake From Sleep Flag bit" name="RCON__SLEEP">
         <value caption="Device was in Sleep mode" name="" value="0x1" />
         <value caption="Device was not in Sleep mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Watchdog Timer Time-out Flag bit" name="RCON__WDTO">
         <value caption="WDT Time-out has occurred" name="" value="0x1" />
         <value caption="WDT Time-out has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Software Reset Flag bit" name="RCON__SWR">
         <value caption="Software Reset was executed" name="" value="0x1" />
         <value caption="Software Reset as not executed" name="" value="0x0" />
      </value-group>
      <value-group caption="External Reset (MCLR) Pin Flag bit" name="RCON__EXTR">
         <value caption="Master Clear (pin) Reset has occurred" name="" value="0x1" />
         <value caption="Master Clear (pin) Reset has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Voltage Regulator Standby Enable bit" name="RCON__VREGS">
         <value caption="Regulator is enabled and is on during Sleep mode" name="" value="0x1" />
         <value caption="Regulator is set to standby tracking mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Configuration Mismatch Reset Flag bit" name="RCON__CMR">
         <value caption="Configuration mismatch Reset has occurred" name="" value="0x1" />
         <value caption="Configuration mismatch Reset has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Software Reset Trigger bit" name="RSWRST__SWRST">
         <value caption="Enable Software Reset event" name="" value="0x1" />
         <value caption="No effect" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="00748" name="RTCC" version="1">
      <register-group name="RTCC">
         <register caption="RTC Control Register" name="RTCCON" offset="0x0" rw="RW" size="4">
            <bitfield caption="RTCC Output Enable bit" mask="0x00000001" name="RTCOE" values="RTCCON__RTCOE" />
            <bitfield caption="Half-Second Status bit" mask="0x00000002" name="HALFSEC" values="RTCCON__HALFSEC" />
            <bitfield caption="RTCC Value Registers Read Synchronization bit" mask="0x00000004" name="RTCSYNC" values="RTCCON__RTCSYNC" />
            <bitfield caption="RTC Value Registers Write Enable bit" mask="0x00000008" name="RTCWREN" values="RTCCON__RTCWREN" />
            <bitfield caption="RTCC Clock Enable Status bit" mask="0x00000040" name="RTCCLKON" values="RTCCON__RTCCLKON" />
            <bitfield caption="RTCC Seconds Clock Output Select bit" mask="0x00000080" name="RTSECSEL" values="RTCCON__RTSECSEL" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="RTCCON__SIDL" />
            <bitfield caption="RTCC On bit" mask="0x00008000" name="ON" values="RTCCON__ON" />
            <bitfield caption="RTC Drift Calibration bits" mask="0x03FF0000" name="CAL" values="RTCCON__CAL" />
         </register>
         <register caption="RTC ALARM Control Register" name="RTCALRM" offset="0x10" rw="RW" size="4">
            <bitfield caption="Alarm Repeat Counter Value bits" mask="0x000000FF" name="ARPT" values="RTCALRM__ARPT" />
            <bitfield caption="Alarm Mask Configuration bits" mask="0x00000F00" name="AMASK" values="RTCALRM__AMASK" />
            <bitfield caption="Alarm Sync bit" mask="0x00001000" name="ALRMSYNC" values="RTCALRM__ALRMSYNC" />
            <bitfield caption="Alarm Pulse Initial Value bit" mask="0x00002000" name="PIV" values="RTCALRM__PIV" />
            <bitfield caption="Chime Enable bit" mask="0x00004000" name="CHIME" values="RTCALRM__CHIME" />
            <bitfield caption="Alarm Enable bit" mask="0x00008000" name="ALRMEN" values="RTCALRM__ALRMEN" />
         </register>
         <register caption="RTC Time Value Register" name="RTCTIME" offset="0x20" rw="RW" size="4">
            <bitfield mask="0x00000F00" name="SEC01" />
            <bitfield mask="0x0000F000" name="SEC10" />
            <bitfield mask="0x000F0000" name="MIN01" />
            <bitfield mask="0x00F00000" name="MIN10" />
            <bitfield mask="0x0F000000" name="HR01" />
            <bitfield mask="0xF0000000" name="HR10" />
         </register>
         <register caption="RTC Date Value Register" name="RTCDATE" offset="0x30" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="WDAY01" />
            <bitfield mask="0x00000F00" name="DAY01" />
            <bitfield mask="0x0000F000" name="DAY10" />
            <bitfield mask="0x000F0000" name="MONTH01" />
            <bitfield mask="0x00F00000" name="MONTH10" />
            <bitfield mask="0x0F000000" name="YEAR01" />
            <bitfield mask="0xF0000000" name="YEAR10" />
         </register>
         <register caption="Alarm Time Value Register" name="ALRMTIME" offset="0x40" rw="RW" size="4">
            <bitfield mask="0x00000F00" name="SEC01" />
            <bitfield mask="0x0000F000" name="SEC10" />
            <bitfield mask="0x000F0000" name="MIN01" />
            <bitfield mask="0x00F00000" name="MIN10" />
            <bitfield mask="0x0F000000" name="HR01" />
            <bitfield mask="0xF0000000" name="HR10" />
         </register>
