MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX795F512H.atdf
      <value-group caption="RESUME Signaling Enable bit" name="U1CON__RESUME">
         <value caption="RESUME signaling is activated" name="" value="0x1" />
         <value caption="RESUME signaling is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Host Mode Enable bit" name="U1CON__HOSTEN">
         <value caption="USB host capability is enabled" name="" value="0x1" />
         <value caption="USB host capability is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Module Reset bit" name="U1CON__USBRST">
         <value caption="USB reset is generated" name="" value="0x1" />
         <value caption="USB reset is terminated" name="" value="0x0" />
      </value-group>
      <value-group caption="Live Single-Ended Zero flag bit" name="U1CON__SE0">
         <value caption="Single Ended Zero detected on the USB" name="" value="0x1" />
         <value caption="No Single Ended Zero detected" name="" value="0x0" />
      </value-group>
      <value-group caption="Live Differential Receiver JSTATE flag bit" name="U1CON__JSTATE">
         <value caption="JSTATE detected on the USB" name="" value="0x1" />
         <value caption="No JSTATE detected" name="" value="0x0" />
      </value-group>
      <value-group caption="USB Module Enable bit" name="U1CON__USBEN">
         <value caption="(Device mode) USB module and supporting circuitry is enabled / (Host mode) SOF token sent every 1 ms" name="" value="0x1" />
         <value caption="(Device mode) USB module and supporting circuitry is disabled / (Host mode) SOF token is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="7-bit USB Device Address bits" name="U1ADDR__DEVADDR">
         <value caption="Device address is 0x7f" name="" value="0x7f" />
         <value caption="Device address is 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Low Speed Enable Indicator bit" name="U1ADDR__LSPDEN">
         <value caption="Next token command to be executed at Low Speed" name="" value="0x1" />
         <value caption="Next token command to be executed at Full Speed" name="" value="0x0" />
      </value-group>
      <value-group caption="Token Command Endpoint Address bits" name="U1TOK__EP">
         <value caption="Endpoint address is 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Token Type Indicator bits" name="U1TOK__PID">
         <value caption="OUT (TX) token type transaction" name="" value="0x1" />
         <value caption="IN (RX) token type transaction" name="" value="0x9" />
         <value caption="SETUP (TX) token type transaction" name="" value="0xd" />
      </value-group>
      <value-group caption="SOF Threshold Value bits" name="U1SOF__CNT">
         <value caption="64-byte packet" name="" value="0x4a" />
         <value caption="32-byte packet" name="" value="0x2a" />
         <value caption="16-byte packet" name="" value="0x1a" />
         <value caption="8-byte packet" name="" value="0x12" />
      </value-group>
      <value-group caption="BDT Base Address bits" name="U1BDTP2__BDTPTRH">
         <value caption="BDT base address is 0" name="" value="0x0" />
      </value-group>
      <value-group caption="BDT Base Address bits" name="U1BDTP3__BDTPTRU">
         <value caption="BDT base address is 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Automatic Suspend Enable bit" name="U1CNFG1__UASUSPND">
         <value caption="USB module automatically suspends upon entry to Sleep mode." name="" value="0x1" />
         <value caption="USB module does not automatically suspend upon entry to Sleep mode." name="" value="0x0" />
      </value-group>
      <value-group caption="Low-Speed Device Enable bit" name="U1CNFG1__LSDEV">
         <value caption="USB module operates in Low-Speed Device mode only" name="" value="0x1" />
         <value caption="USB module operates in OTG, Host, or Full-Speed Device mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Stop in Idle Mode bit" name="U1CNFG1__USBSIDL">
         <value caption="Discontinue module operation when device enters Idle mode" name="" value="0x1" />
         <value caption="Continue module operation in Idle mode" name="" value="0x0" />
      </value-group>
      <value-group caption="USB Eye-Pattern Test Enable bit" name="U1CNFG1__UTEYE">
         <value caption="Eye-Pattern Test is enabled" name="" value="0x1" />
         <value caption="Eye-Pattern Test is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint Handshake Enable bit" name="U1EP0__EPHSHK">
         <value caption="Endpoint Handshake is enabled" name="" value="0x1" />
         <value caption="Endpoint Handshake is disabled (typically used for isochronous endpoints)" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint Stall Status bit" name="U1EP0__EPSTALL">
         <value caption="Endpoint n was stalled" name="" value="0x1" />
         <value caption="Endpoint n was not stalled" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint Transmit Enable bit" name="U1EP0__EPTXEN">
         <value caption="Endpoint n transmit is enabled" name="" value="0x1" />
         <value caption="Endpoint n transmit is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint Receive Enable bit" name="U1EP0__EPRXEN">
         <value caption="Endpoint n receive is enabled" name="" value="0x1" />
         <value caption="Endpoint n receive is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Bidirectional Endpoint Control bit" name="U1EP0__EPCONDIS">
         <value caption="Disable Endpoint n from Control transfers; only TX and RX transfers allowed" name="" value="0x1" />
         <value caption="Enable Endpoint n for Control (SETUP) transfers; TX and RX transfers also allowed" name="" value="0x0" />
      </value-group>
      <value-group caption="Retry Disable bit (Host mode and U1EP0 only)" name="U1EP0__RETRYDIS">
         <value caption="Retry NAKed transactions is disabled" name="" value="0x1" />
         <value caption="Retry NAKed transactions is enabled; retry done in hardware" name="" value="0x0" />
      </value-group>
